app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = ?  [["user_id", 1]]
---
    def index
        @companies = Company.where(user_id: session[:user_id])

INSERT INTO "companies" ("user_id", "name", "url", "mypage_id", "mypage_pwd", "task1", "due1", "task2", "due2", "task3", "task4", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        company_params = params.require(:company).permit(:name,:url,:mypage_id,:mypage_pwd,:task1,:due1,:task2,:due2,:task3,:due3,:task4,:due4)
        company_params[:user_id] = session[:user_id]
        @company = Company.new(company_params)
        if @company.save

UPDATE "companies" SET "mypage_id" = ?, "mypage_pwd" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["mypage_id", "id"], ["mypage_pwd", "password"], ["updated_at", "2022-07-26 16:48:58.036794"], ["id", 2]]
---
    def update
        company_params = params.require(:company).permit(:name,:url,:mypage_id,:mypage_pwd,:task1,:due1,:task2,:due2,:task3,:due3,:task4,:due4)
        if @company.update(company_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? AND "companies"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = ?  [["user_id", 1]]
---
    def schedule
        companies = Company.where(user_id: session[:user_id])
        task_due_array = []
        companies.each do |company|

UPDATE "companies" SET "task4" = ?, "task1" = ?, "due1" = ?, "task3" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["task4", nil], ["task1", ""], ["due1", nil], ["task3", nil], ["updated_at", "2022-08-03 15:21:59.606449"], ["id", 4]]
---
    def complete
        # dueとtaskは消したところから1つずつずらす
            @company.task4=nil
            @company.due4=nil
        if @company.task1==params[:task] && @company.due1==params[:due]
            @company.task1=@company.task2
            @company.due1=@company.due2
            @company.task2=@company.task3
            @company.due2=@company.due3
            @company.task3=@company.task4
            @company.due3=@company.due4
        elsif @company.task2==params[:task] && @company.due2==params[:due]
            @company.task2=@company.task3
            @company.due2=@company.due3
            @company.task3=@company.task4
            @company.due3=@company.due4
        elsif @company.task3==params[:task] && @company.due3==params[:due]
            @company.task3=@company.task4
            @company.due3=@company.due4
        end
        @company.save

SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? AND "companies"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
    def set_company
        @company = Company.where(user_id: session[:user_id]).find(params[:id])