app/controllers/companies_controller.rb

    def schedule
        companies = Company.where(user_id: session[:user_id])
        task_due_array = []
        companies_name = []
        companies.each do |company|
---
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? AND "companies"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]