app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."login_id" = ? LIMIT ?  [["login_id", "aaa"], ["LIMIT", 1]]
---
    def create
        user = User.find_by(login_id: params[:login_id])