app/controllers/users_controller.rb

INSERT INTO "users" ("login_id", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["login_id", "aa"], ["created_at", "2022-07-25 16:14:39.112971"], ["updated_at", "2022-07-25 16:14:39.112971"], ["password_digest", "$2a$12$ZYowKnr3qpj6kFIhc7hlNupTmUq7Fp751.ZR.fnBzOtdzOGmH5zi."]]
---
    def create
        user_params = params.require(:user).permit(:login_id,:password,:password_confirmation)
        @user = User.new(user_params)
        logger.debug("!!!!")
        logger.debug(user_params)
        logger.debug(@user.password.present?)
        logger.debug(@user.password_confirmation)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "login_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["login_id", "aaa"], ["updated_at", "2022-07-26 03:18:37.387101"], ["id", 1]]
---
    def update
        @user = User.find(session[:user_id])
         user_params = params.require(:user).permit(:login_id)
         if @user.update(user_params)